In [1]:
import pandas as pd

In [2]:
details = pd.read_csv(r"C:\Users\anusk\Downloads\Employee deets.csv")

In [3]:
details

   EmployeeID     Name  Age        Department  Salary
0           1    Alice   25                HR    2500
1           2      Bob   26          Finance     2600
2           3  Charlie   27         Marketing    2700
3           4    David   28             Sales    2800
4           5      Eva   29        Operations    2900
5           6    Fiona   30                IT    3000
6           7   George   31  Customer Service    3100

In [4]:
details.isnull()

   EmployeeID   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False  False       False   False
4       False  False  False       False   False
5       False  False  False       False   False
6       False  False  False       False   False

In [5]:
details.isnull().sum()

EmployeeID    0
Name          0
Age           0
Department    0
Salary        0
dtype: int64

In [10]:
details['Name'].unique()

array(['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Fiona', 'George'],
      dtype=object)

In [11]:
details['Department'].unique()

array(['HR', 'Finance ', 'Marketing', 'Sales', 'Operations', 'IT',
       'Customer Service'], dtype=object)

In [12]:
details['Salary'].unique()

array([2500, 2600, 2700, 2800, 2900, 3000, 3100], dtype=int64)

In [13]:
details['Age'].unique()

array([25, 26, 27, 28, 29, 30, 31], dtype=int64)

In [17]:
details['EmployeeID'].unique()

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [14]:
details.to_csv('Employee_Details.csv', index=False)

In [15]:
Employee_Details = pd.DataFrame(details)

In [16]:
Employee_Details

   EmployeeID     Name  Age        Department  Salary
0           1    Alice   25                HR    2500
1           2      Bob   26          Finance     2600
2           3  Charlie   27         Marketing    2700
3           4    David   28             Sales    2800
4           5      Eva   29        Operations    2900
5           6    Fiona   30                IT    3000
6           7   George   31  Customer Service    3100